{
  "description": "<p>Current version: <a href=\"https://github.com/GLAM-Workbench/web-archives/releases/tag/v1.0.0\">v1.0.0</a></p> <p>We tend to think of a web archive as a site we go to when links are broken – a useful fallback, rather than a source of new research data. But web archives don’t just store old web pages, they capture multiple versions of web resources over time. Using web archives we can observe change – we can ask historical questions. This collection of notebooks is intended to help historians, and other researchers, frame those questions by revealing what sort of data is available, how to get it, and what you can do with it.</p> <p>Web Archives share systems and standards, making it much easier for researchers wanting to get their hands on useful data. These notebooks focus on four particular web archives: the <a href=\"https://www.webarchive.org.uk/\">UK Web Archive</a>, the <a href=\"https://trove.nla.gov.au/website\">Australian Web Archive</a> (National Library of Australia ), the <a href=\"https://natlib.govt.nz/collections/a-z/new-zealand-web-archive\">New Zealand Web Archive</a> (National Library of New Zealand), and the <a href=\"https://archive.org/web/\">Internet Archive</a>. However, the tools and approaches here could be easily extended to other web archives.</p> <p>Web archives are huge, and access is often limited for legal reasons. These notebooks focus on data that is readily accessible and able to be used without the need for special equipment. They use existing APIs to get data in manageable chunks. But many of the examples demonstrated can also be scaled up to build substantial datasets for analysis – you just have to be patient!</p> <p>These notebooks are a starting point that I hope will encourage researchers to investigate the possibilities of web archives in more detail. They’re intended to compliment the fabulous work being by projects such as <a href=\"https://archivesunleashed.org/\">Archives Unleashed</a> to open web archives to new research uses.</p> <p>The development of these notebooks was supported by the International Internet Preservation Consortium’s <a href=\"http://netpreserve.org/projects/\">Discretionary Funding Programme 2019-2020</a>, with the participation of the British Library, the National Library of Australia, and the National Library of New Zealand. Thanks all!</p> <p>See the <a href=\"https://glam-workbench.github.io/web-archives/\">web archives section</a> of the <a href=\"https://glam-workbench.github.io/\">GLAM Workbench</a> for more information.</p> <h2 id=\"notebook-topics\">Notebook topics</h2> <h3 id=\"types-of-data\">Types of data</h3> <ul> <li><strong>Timegates, Timemaps, and Mementos</strong> – explore how the Memento protocol helps you get machine-readable data about web archive captures</li> <li><strong>Exploring the Internet Archive’s CDX API</strong> – some web archives provide indexes of the web pages they’ve archived through an API, this notebook looks in detail at the data provided by the Internet Archive’s CDX API</li> <li><strong>Comparing CDX APIs</strong> – this notebook documents differences between the Internet Archive’s Wayback CDX API and the PyWb CDX API (used by AWA and UKWA)</li> <li><strong>Timemaps vs CDX APIs</strong> – both Timemaps and CDX APIs can give us a list of captures from a particular web page, this notebook compares the results</li> </ul> <h3 id=\"harvesting-data-and-creating-datasets\">Harvesting data and creating datasets</h3> <ul> <li><strong>Get the archived version of a page closest to a particular date</strong> – the Memento API enables us to get the archived version of a page closest to a particular date, the functions in this notebook smooth out these some variations across repositories</li> <li><strong>Find all the archived versions of a web page</strong> – you can get all the captures of an archived page using either Timemaps or the CDX API, this notebook demonstrates both</li> <li><strong>Harvesting collections of text from archived web pages</strong> – create a dataset from the text contents of a single page across time, or multiple pages</li> <li><strong>Harvesting data about a domain using the IA CDX API</strong> – extract information about a whole domain using <code>prefix</code> and <code>domain</code> queries</li> <li><strong>Find and explore Powerpoint presentations from a specific domain</strong> – a complete workflow from web archive to Powerpoints to PDFS to images and text, and explore it all in Datasette</li> <li><strong>Exploring subdomains in the whole of gov.au</strong> - scale up your harvesting to assemble a complete set of subdomains over time, and visualise the results as a dendrogram</li> </ul> <h3 id=\"exploring-change-over-time\">Exploring change over time</h3> <ul> <li><strong>Compare two versions of an archived web page</strong> – demonstrates a number of different ways to versions of an archive web page can be compared, from metadata to screenshots</li> <li><strong>Observing change in a web page over time</strong> – getting and visualising information about all the captures of a single page over time</li> <li><strong>Create and compare full page screenshots from archived web pages</strong> – generate full page screenshots of archived web pages, compare pages, captures, even repositories</li> <li><strong>Using screenshots to visualise change in a page over time</strong> – create a time series of screenshots, one for each year, compiled into a single image</li> <li><strong>Display changes in the text of an archived web page over time</strong> – work through, capture by capture, showing how the text contents of an archived web page has changed</li> <li><strong>Find when a piece of text appears in an archived web page</strong> – look for the first or last occurance of text string in an archived web page, or just find every occurance and chart the frequency</li> </ul> <h2 id=\"cite-as\">Cite as</h2> <p>See the GLAM Workbench or <a href=\"https://doi.org/10.5281/zenodo.3894079\">Zenodo</a> for up-to-date citation details.</p> <hr /> <p>This repository is part of the <a href=\"https://glam-workbench.github.io/\">GLAM Workbench</a>.<br /> If you think this project is worthwhile, you might like <a href=\"https://github.com/sponsors/wragge?o=esb\">to sponsor me on GitHub</a>.</p>",
  "license": "MIT",
  "title": "GLAM-Workbench/web-archives",
  "version": "v1.0.0",
  "upload_type": "software",
  "keywords": [
    "GLAM Workbench",
    "web archives"
  ],
  "publication_date": "2021-10-20",
  "creators": [
    {
      "orcid": "0000-0001-7956-4498",
      "name": "Sherratt, Tim"
    },
    {
      "orcid": "0000-0001-8168-0797",
      "affiliation": "The British Library",
      "name": "Jackson, Andrew"
    }
  ],
  "access_right": "open",
  "related_identifiers": [
    {
      "scheme": "url",
      "identifier": "https://github.com/GLAM-Workbench/web-archives/tree/v1.0.0",
      "relation": "isDerivedFrom",
      "resource_type": "software"
    },
    {
      "scheme": "url",
      "identifier": "https://glam-workbench.github.io/web-archives/",
      "relation": "isDocumentedBy",
      "resource_type": "other"
    },
    {
      "scheme": "url",
      "identifier": "https://mybinder.org/v2/zenodo/10.5281/zenodo.3894079/",
      "relation": "isSourceOf",
      "resource_type": "other"
    },
    {
      "scheme": "doi",
      "identifier": "10.5281/zenodo.3894078",
      "relation": "isVersionOf"
    }
  ]
}
